#include <iostream>
#include "windows.h"
#include "array_utils.h"
#include "matrix_utils.h"
using namespace std;

//За допомогою текстового редактору створити текстовий файл «array_in_n.txt» з елементами
// вихідного масиву(n - номер варіанта).У програмі на С++ зчитати і перетворити цей масив 
// відповідно до свого варіанту завдання(див.лаб.роб.No6, завд.2), ім'я файлу і необхідні змінні 
// ввести з консолі.Вивести результати у файл «array_out_n.txt».*/
void task_array79(); // завдання 1

//За допомогою текстового редактору створити текстовий файл «matr_in_n.txt» з елементами 
// вихідного двовимірного масиву(n - номер варіанта).У програмі зчитати і обробити матрицю відповідно
// до свого варіанту завдання(лаб.роб.No7, завд.1), ім'я файлу і необхідні змінні ввести з консолі.
// Дописати результати в той же файл.
void task_matrix71(); // завдання 2

// Вивчити метод сортування відповідно до свого варіанту (див табл. 1), проаналізувати його складність 
// і продемонструвати на прикладі з 7 - ми елементів(відповідно до свого варіанту).Реалізувати у вигляді 
// окремої функції алгоритм сортування елементів масиву.Зчитування і виведення відсортованого 
// масиву організувати на файлах.
void task_3(); // завдання 3

int main()
{
    SetConsoleOutputCP(1251);
    int menu; // Зміна для номеру завдання
    do
    { // початок циклу
        cout << "Номер завдання:"; //введення номеру завдання
        cin >> menu; // обирання номеру завдання
        cout << endl; //вільна строка
        switch (menu) {
        case 1: task_array79(); break; // 1 - завдання 1
        case 2: task_matrix71(); break; // 2 - завдання 2
        case 3: task_3(); break; // 3 - завдання 3
        case -1: cout << "Вихід..." << endl; break; // -1 - вихід
        default: cout << "Помилка! Лише 1, 2!" << endl; // інший номер - повторити
        }
        cout << endl; // вільна строка
        cout << "+---------------------+" << endl; // строка задля полегшення візуального сприймання тексту
        cout << endl; // вільна строка
    } // кінець циклу
    while (menu != -1); // умова виконання циклу
    return 0;
}

// Основна функція для виконання завдання
void task_array79() {
    int mas[N];  // масив для зберігання елементів
    int size;    // розмір масиву
    char filename[100];  // назва файлу для введення/виведення
    cout << "Введіть назву файлу (array_in_8.txt): " << endl; // введення назви файлу, який потрібно відкрити
    cin.ignore(); // звільнення буфера вводу
    cin.getline(filename, 100); // вводимо назву файлу з консолі
    cout << filename << endl; // виведення файлу

    if (get_mas(filename, mas, size)) { // виклик функції для зчитування масиву з файлу
        cout << "Початковий масив:\t\t\t";// якщо масив успішно зчитано, виводиться його на екран
        show_mas(mas, size);

        shift_array_right(mas, size); // зсув елементів масиву вправо
        cout << "Масив після зрушення:\t"; // виведення масиву після зрушення

        show_mas(mas, size);
        write_mas(mas, size); // запис обробленого масиву у файл
    }
}

// Функція для виконання завдання 2
void task_matrix71() {
    int matr[M][N];  // матриця розміру M x N
    int row, col;    // кількість рядків і стовпців
    char filename[100];  // ім'я файлу

    cout << "Введіть назву файлу (matr_in_8.txt): " << endl; // введення назви файлу
    cin.ignore(); // звільнення буфера вводу
    cin.getline(filename, 100);  // введення імені файлу

    if (get_matr(filename, matr, row, col)) { // якщо зчитування матриці з файлу вдалося
        cout << "Початкова матриця: " << endl; // виводимо початкову матрицю
        show_matr(matr, row, col);  // фунуція виведення матриці на екран 

        // Оброблення завдання
        int new_col_count = processed_task_2(matr, row, col);  // дублювання стовпця

        cout << "Матриця після дублювання рядка: " << endl; // виведення повідомлення про дублювання
        show_matr(matr, row, new_col_count);  // виведення матриці після зміни

        write_result_task_2(filename, new_col_count); // запис результату у файл
    }
}

void task_3() { // вирішення завдання 3
    int arr [S];  // масив для сортування
    int n; // кількість елементів масиву
    char filename[100];  // ім'я файлу

    cout << "Введіть назву файлу (sort_in_8.txt): " << endl; // введення назви файлу
    cin.ignore(); // звільнення буфера вводу
    cin.getline(filename, 100);  // введення імені файлу

    if (get_sort(filename, arr, n)) { // якщо зчитування масиву з файлу вдалося
        cout << "Початковий масив: " << endl; // виведення початкового масиву
        write_sort(filename, arr, n);  // запис початкового масиву у файл

        // сортування масиву
        sort(arr, n);  // виклик функції сортування

        cout << "Відсортований масив: " << endl; // виведення відсортованого масиву
        show_sort(arr, n);  // виведення відсортованого масиву на екран

        write_sort(filename, arr, n); // запис відсортованого масиву в файл
    }
}
